In [28]:
import pandas as pd

In [29]:
df = pd.read_excel('dados/tabela_classificacao.xlsx')

In [30]:
df.dtypes

Nome                object
partidas_jogadas     int64
vitorias             int64
empates              int64
derrotas             int64
gols_pro             int64
gols_contra          int64
saldo_gols           int64
pontos               int64
dtype: object

In [31]:
df.describe()

,partidas_jogadas,vitorias,empates,derrotas,gols_pro,gols_contra,saldo_gols,pontos
count,5.0,5.000000,5.000000,5.0,5.00000,5.000000,5.00000,5.000000
mean,10.0,5.600000,2.400000,2.0,18.40000,12.000000,6.40000,19.200000
std,0.0,2.073644,1.140175,1.0,5.94138,4.949747,6.69328,5.118594
min,10.0,3.000000,1.000000,1.0,10.00000,5.000000,-3.00000,13.000000
25%,10.0,4.000000,2.000000,1.0,15.00000,10.000000,5.00000,15.000000
50%,10.0,6.000000,2.000000,2.0,20.00000,12.000000,5.00000,20.000000
75%,10.0,7.000000,3.000000,3.0,22.00000,15.000000,10.00000,23.000000
max,10.0,8.000000,4.000000,3.0,25.00000,18.000000,15.00000,25.000000

In [32]:
df.head(2)

,Nome,partidas_jogadas,vitorias,empates,derrotas,gols_pro,gols_contra,saldo_gols,pontos
0,flamengo,10,8,1,1,25,10,15,25
1,palmeiras,10,7,2,1,22,12,10,23

In [33]:
df.tail(2)

,Nome,partidas_jogadas,vitorias,empates,derrotas,gols_pro,gols_contra,saldo_gols,pontos
3,sao paulo,10,4,3,3,15,18,-3,15
4,corinthians,10,3,4,3,10,5,5,13

In [34]:
# Analize de desempenho por time 
desempenho_info = df[['Nome','pontos','vitorias','saldo_gols','gols_pro','gols_contra']].set_index('Nome')
desempenho_info

             pontos  vitorias  saldo_gols  gols_pro  gols_contra
Nome
flamengo         25         8          15        25           10
palmeiras        23         7          10        22           12
santos           20         6           5        20           15
sao paulo        15         4          -3        15           18
corinthians      13         3           5        10            5

In [35]:
time_com_mais_vitorias = df[df['vitorias'] == df['vitorias'].max()]
time_com_mais_vitorias

,Nome,partidas_jogadas,vitorias,empates,derrotas,gols_pro,gols_contra,saldo_gols,pontos
0,flamengo,10,8,1,1,25,10,15,25

In [36]:
df['gols_pro'].value_counts()

gols_pro
25    1
22    1
20    1
15    1
10    1
Name: count, dtype: int64

In [37]:
correlacao = df['gols_pro'].corr(df['gols_contra'])
correlacao

np.float64(0.2550297637102389)